Repository: ic1998/Cor-En
Catalog: TMX_datasets/9_en_kw.tmx
Source language: en
Languages: kw

source: He'll have to do this task again.
kw: Res vydh dhodho gul arta an oberen ma.

source: I don't want to go outside.
kw: Ny vynnav vy mos yn-mes.

source: Is this a flower?
kw: Yw homma bleujen?

source: I will work.
kw: My a vynn oberi.

source: I'm learning English.
kw: Yth esov vy ow tyski Sowsnek.

source: I can't sleep.
kw: Ny allav koska.

source: I'm eating.
kw: Yth esov vy ow tybri.

source: You are a dog.
kw: Ki os ta.

source: I'm not a doctor.
kw: Nyns ov medhek.

source: Do you have a dog?
kw: Eus ki dhymm?

source: I like eating cake.
kw: Da y genev dybri tesen.

source: This is ice.
kw: Hemm yw yey.

source: She's coming!
kw: Yma hi ow tos!

source: There's not enough coffee.
kw: Nyns eus koffi lowr.

source: The weather was very good.
kw: Pur dha o an gewer.

source: Forgive me!
kw: Gav dhymm!

source: I still want to go.
kw: My a vynn hwath mos.

source: I like to listen to music.
kw: Da yw genev goslowes orth ilow.

source: It snows outside.
kw: Hi a wra ergh yn-mes.

source: She likes to sing.
kw: Da yw gensi kana.

source: I was waiting for you.
kw: Yth esen vy ow kortos ragos.

source: You ran back here.
kw: Ty a bonyas arta omma.

source: I don't like big dogs.
kw: Nyns yw da genev keun bras.

source: I don't have a dog.
kw: Nyns eus ki dhymm.

source: I've been waiting for two hours.
kw: My re bia ow kortos rag dew our.

source: You don't need to come.
kw: Nyns yw res dhis dos.

source: You don't need to do that.
kw: Nyns yw res dhis gul henna.

source: Be quiet.
kw: Bydh kosel.

source: I can't read French.
kw: Ny allav vy redya Frynkek.

source: Do I have to come home now?
kw: Yw res dhymm dos tre lemmyn?

source: I want snow.
kw: My a vynn kavos ergh.

source: Where did you see them?
kw: Ple y’s gwelsys?

source: We have a big dog.
kw: Yma ki bras dhyn.

source: I'm working tomorrow.
kw: Yth esov vy owth oberi a-vorow.

source: Don't wait.
kw: Na wra gortos.

source: He has a white cat.
kw: Yma dhodho kath wynn.

source: That was yesterday.
kw: De o henna.

source: You must work.
kw: Res yw dhis oberi.

source: He didn't need to bring an umbrella.
kw: Nyns o res dhodho dri an lawlen.

source: You can come.
kw: Hwi a yll dos.

source: She's my wife.
kw: Ow gwreg yw hi.

source: I like men.
kw: Da yw genev tus.

source: She has two sisters.
kw: Yma diw hwor dhedhi.

source: The new teacher is in the classroom.
kw: Yma'n dyskador nowyth yn stevel an klass.

source: I like horses.
kw: Da yw genev mergh.

source: He has two sisters.
kw: Yma diw hwor dhodho.

source: Be happy!
kw: Bydh lowen!

source: I can't open it!
kw: Ny allav y ygeri!

source: These are old photos.
kw: An re ma yw skeusennow koth.

source: He has ten children.
kw: Yma dhodho deg flogh.

source: I want to dance.
kw: My a vynn donsya.

source: I'm reading.
kw: Yth esov vy ow redya.

source: I read.
kw: My a red.

source: Stay here!
kw: Gorta omma!

source: Look at me!
kw: Mir orthiv!

source: Forgive me.
kw: Gav dhymm.

source: You didn't need to bring your umbrella.
kw: Nyns o res dhis dri dha lawlen.

source: The weather is terrible today.
kw: Euthyk yw an gewer hedhyw.

source: This is Ken's dog.
kw: Ki Ken yw hemma.

source: I am not a student.
kw: Nyns ov studhyer.

source: He wants to speak.
kw: Ev a vynn kewsel.

source: I want to eat.
kw: My a vynn dybri.

source: That's her boyfriend.
kw: Henn yw hy harer.

source: See you!
kw: Dha weles!

source: I don't want to listen to you.
kw: Ny vynnav goslowes orthis.

source: Tea, please.
kw: Te, mar pleg.

source: I don't like wine.
kw: Nyns yw da genev gwin.

source: It works.
kw: Ev a ober.

source: I'm not hungry.
kw: Nyns eus nown dhymm.

source: She went to the cinema with him.
kw: Hi eth dhe’n cinema ganso.

source: It's five o'clock.
kw: Pymp eur yw.

source: Come with me!
kw: Deus genev!

source: Is this our hotel?
kw: Yw homma agan ostel?

source: I am drinking coffee.
kw: Yth esov vy owth eva koffi.

source: I hate Tom.
kw: Kas yw genev Tom.

source: I hate snow!
kw: Kas yw genev ergh!

source: I won't forget that.
kw: Ny vynnav ankevi henna.

source: Are you coming?
kw: Esos ta ow tos?

source: I have to go to the toilet.
kw: Res yw dhymm mos dhe'n bisva.

source: I must go to the toilet.
kw: Res yw dhymm mos dhe'n bisva.

source: It rained.
kw: Hi a wrug glaw.

source: Yesterday was cloudy.
kw: Komolek o de.

source: Where is my brother?
kw: Ple’ma ow broder?

source: I need to buy stamps.
kw: Yma edhomm dhymm a brena stampow.

source: Where is my dog?
kw: Ple'ma ow gi?

source: We must party.
kw: Res yw dhyn kevewya.

source: You didn't need to buy this book.
kw: Nyns o res dhis prena an lyver ma.

source: Do you like this girl?
kw: Yw da genes an vowes ma?

source: You didn't need to come.
kw: Nyns o res dhis dos.

source: You don't need to go there.
kw: Nyns yw res dhis mos ena.

source: You don't need to stand up.
kw: Nyns yw res dhis sevel.

source: Do I have to go?
kw: Yw res dhymm mos?

source: I still love you.
kw: My a’th kar hwath.

source: Today is Wednesday.
kw: dy'Mergher yw hedhyw.

source: He went shopping.
kw: Ev eth dhe brenassa.

source: I want to leave.
kw: My a vynn diberth.

source: I could see that.
kw: My a allas gweles henna.

source: I can't speak German.
kw: Ny allav vy kewsel Almaynek.

source: They like to sing.
kw: Da yw gansa kana.

source: I don't want to drink anything.
kw: Ny vynnav vy eva tra vydh.

source: Listen to me.
kw: Goslow orthiv.

source: I have a terrible headache!
kw: Yma drog penn euthyk dhymm!

source: I am eating.
kw: Yth esov vy ow tybri.

source: Where is the bridge?
kw: Ple'ma an pons?

source: This is terrible.
kw: Hemm yw euthyk.

source: This sentence hasn't yet been translated.
kw: Ny veu an lavar-ma treylys whath.

source: Is that French?
kw: Yw henna frynkek?

source: I understood.
kw: My a wrug konvedhes.

source: Don't you have a pen?
kw: A nyns eus dhis pluven?

source: Where are my books?
kw: Ple’ma ow lyvrow?

source: Eat your food.
kw: Gwra dybri dha voos.

source: I like it.
kw: Da yw genev.

source: We need to talk.
kw: Res yw dhyn kewsel.

source: He is reading.
kw: Yma ev ow redya.

source: Where was the police?
kw: Ple'th esa an kreslu?

source: We must go.
kw: Res yw dhyn mos.

source: I like English.
kw: Da yw genev Sowsnek.

source: I can't stay here.
kw: Ny allav vy gortos omma.

source: What's Tom reading?
kw: Pandr'yw Tom ow redya?

source: That is old news.
kw: Henn yw nowodhow koth.

source: I am thirsty.
kw: Yma sehes dhymm.

source: I don't want to study German.
kw: Ny vynnav vy studhya Almaynek.

source: We have to do something.
kw: Res yw dhyn gul neppyth.

source: That is my dog.
kw: Ow gi yw henna.

source: Want fries with that?
kw: A vynn'ta asklos gans henna?

source: Write your name.
kw: Skrif dha hanow.

source: What are these?
kw: Pyth yw an re ma?

source: We want to go.
kw: Ni a vynn mos.

source: I love this song.
kw: My a gar an gan-ma.

source: We know.
kw: Ni a wor.

source: He spoke.
kw: Ev a gewsis.

source: I'm not sure.
kw: Nyns ov sur.

source: He does not know.
kw: Ny wor.

source: I don't like winter.
kw: Nyns yw da genev gwav.

source: I don't want to read anything.
kw: Ny vynnav vy redya tra vydh.

source: She needs to sleep more.
kw: Res yw dhedhi koska moy.

source: My mum has three dogs.
kw: Yma tri hi dhe ow mamm.

source: Stand up.
kw: Sav yn-bann.

source: I am going.
kw: Yth esov vy ow mos.

source: I don't like to paint.
kw: Nyns yw da genev payntya.

source: I work.
kw: My a ober.

source: He's got two cars.
kw: Yma dhodho dew garr-tan.

source: He has two cars.
kw: Yma dhodho dew garr-tan.

source: I came to kill him.
kw: My a dheuth dh’y ladha.

source: I don't like chocolate.
kw: Nyns yw da genev choklet.

source: Where art thou?
kw: Ple’th esos ta?

source: Again?
kw: Arta?

source: Excellent!
kw: Bryntin!

source: I am not sure.
kw: Nyns ov sur.

source: That wall is cold.
kw: An fos na yw yeyn.

source: I hate football.
kw: Kas yw genev pel droos.

source: I hate soccer.
kw: Kas yw genev pel droos.

source: Hi, friend!
kw: Dydh da, sos!

source: We are coming.
kw: Yth eson ni ow tos.

source: Look there.
kw: Ottena.

source: What's this dog's name?
kw: Pyth yw hanow an ki ma?

source: I don't want to hear it.
kw: Ny vynnav vy y glewes.

source: Hello, girls.
kw: Dydh da, mowesi.

source: Do you like your sister?
kw: Yw da genes dha hwor?

source: Do you like your brother?
kw: Yw da genes dha vroder?

source: Do you like this city?
kw: Yw da genes an cita ma?

source: I like snow.
kw: Da yw genev ergh.

source: I have a very beautiful dog.
kw: Yma ki pur deg dhymm.

source: I have two sons and two daughters.
kw: Yma dhymm dew vab ha diw vyrgh.

source: I can't do that.
kw: Ny allav gul henna.

source: She wants to study music and dance.
kw: Hi a vynn studhya ilow ha dons.

source: Where is a doctor?
kw: Ple'ma medhek?

source: Where is a hospital?
kw: Ple'ma klavji?

source: I'd like a ticket to Boston.
kw: My a garsa kavos tokyn dhe Boston.

source: I want to help.
kw: My a vynn gweres.

source: Say something!
kw: Lavar neppyth!

source: There's a cat on the table.
kw: Yma kath war'n voos.

source: I need to stop.
kw: Res yw dhymm hedhi.

source: You need to stop.
kw: Res yw dhis hedhi.

source: I'm coming home.
kw: Yth esov vy ow tos tre.

source: They don't have to know.
kw: Nyns yw res dhedha godvos.

source: We'll have to wait for five hours.
kw: Res vydh dhyn gortos rag pymp our.

source: You'll have to start.
kw: Res vydh dhis dalleth.

source: I don't want to know.
kw: Ny vynnav vy godhvos.

source: She liked that.
kw: Da o gensi henna.

source: Do you like your car?
kw: Yw da genes dha garr?

source: Is this car new?
kw: Yw an karr ma nowydh?

source: We'll have to go back.
kw: Res vydh dhyn mos arta.

source: She was surprised too.
kw: Yth esa marth dhedhi ynwedh.

source: He was surprised too.
kw: Yth esa marth dhodho ynwedh.

source: I have a headache today.
kw: Yma drog penn dhymm hedhyw.

source: I'm hungry and thirsty.
kw: Yma nown ha seghes dhymm.

source: He's hungry and thirsty.
kw: Yma nown ha seghes dhodho.

source: She's hungry and thirsty.
kw: Yma nown ha seghes dhedhi.

source: Why are they doing this?
kw: Prag ymons i ow kul hemma?

source: He's looking at dinosaurs.
kw: Yma ev ow mires orth arghpedrevanes.

source: Very strange.
kw: Pur goynt.

source: He took honey instead of sugar.
kw: Ev a gemeras mel yn le sugra.

source: We have to go.
kw: Res yw dhyn mos.

source: You have to do it.
kw: Res yw dhis y wul.

source: Wait!
kw: Gorta!

source: How is the weather in your country?
kw: Fatel yw an gewer yn dha vro?

source: I have to win.
kw: Res yw dhymm gwaynya.

source: I have to work.
kw: Res yw dhymm oberi.

source: I have to try.
kw: Res yw dhymm assaya.

source: I have to go back.
kw: Res yw dhymm mos arta.

source: I still want to be here.
kw: My a vynn hwath bos omma.

source: Are you sad?
kw: Os ta trist?

source: Is this a letter?
kw: Yw hemma lyther?

source: Is this your letter?
kw: Yw hemma dha lyther?

source: Is this your beer?
kw: Yw hemma dha gorev?

source: I like to buy clothes.
kw: Da yw genev prena dillas.

source: I didn't need to go to Germany.
kw: Nyns o res dhymm mos dhe Almayn.

source: Is this your wine?
kw: Yw hemma dha win?

source: Is this my wine?
kw: Yw hemma ow gwin?

source: Is this wine?
kw: Yw hemma gwin?

source: Laurie is a beautiful girl.
kw: Mowes teg yw Laurie.

source: This is their handbag.
kw: Homm yw aga thigen.

source: This is your handbag.
kw: Homm yw dha digen.

source: This is her handbag.
kw: Homm yw hy thigen.

source: This is his handbag.
kw: Homm yw y digen.

source: This is my handbag.
kw: Homm yw ow thigen.

source: The sun is white.
kw: Gwynn yw an howl.

source: This is my pencil.
kw: Homm yw ow fluven blomm.

source: Tom doesn't like his work.
kw: Nyns yw da gans Tom y ober.

source: Your dog is over there.
kw: Yma dha gi ena.

source: How much?
kw: Pygemmys?

source: The weather is cold.
kw: Yeyn yw an gewer.

source: The weather is windy.
kw: Gwynsek yw an gewer.

source: The weather is hot.
kw: Pooth yw an gewer.

source: The weather is sunny.
kw: Howlyek yw an gewer.

source: The weather is cloudy.
kw: Komolek yw an gewer.

source: The weather is foggy.
kw: Niwlek yw an gewer.

source: The weather is rainy.
kw: Glawek yw an gewer.

source: The weather is snowy.
kw: Erghek yw an gewer.

source: The weather is good.
kw: Da yw an gewer.

source: Is this your dictionary?
kw: Yw hemma dha erlyver?

source: I love autumn.
kw: My a gar an kynnyav.

source: He owns one cat and two dogs.
kw: Yma dhodho unn gath ha dew gi.

source: I am tired!
kw: Skwith ov.

source: I work on Sunday.
kw: My a wra oberi dy Sul.

source: Why do you want to do this?
kw: Prag y fynn'ta gul hemma?

source: At what time do you eat breakfast?
kw: Dhe by eur a wre'ta dybri hansel?

source: We're leaving.
kw: Yth eson ni ow tiberth.

source: I'm eating here.
kw: Yth esov vy ow tybri omma.

source: The weather is very hot.
kw: Pooth yw an gewer.

source: I need to work.
kw: Res yw dhymm oberi.

source: He's rich.
kw: Golusek yw ev.

source: Do you want to drink tea or coffee?
kw: A vyn’ta eva te po koffi?

source: My cat will love this.
kw: Ow hath a vynn kara hemma.

source: I know!
kw: Gonn!

source: I won't die.
kw: Ny vynnav merwel.

source: I'm not dead.
kw: Nyns ov marow.

source: The dog is sleeping in the car.
kw: Yma'n ki ow koska y'n karr.

source: I must know.
kw: Res yw dhymm godhvos.

source: She's coming.
kw: Yma hi ow tos.

source: Why do you want to learn this language?
kw: Prag y fynn'ta dyski an yeth ma?

source: We must do something.
kw: Res yw dhyn gul neppyth.

source: That is my sister.
kw: Honn yw ow hwor.

source: She likes money.
kw: Da yw gensi arghans.

source: I'll sleep in my room.
kw: My a vynn koska yn ow chambour.

source: I must wait here.
kw: Res yw dhymm gortos omma.

source: You don't want to know.
kw: Ny vynn'ta godhvos.

source: I don't want to eat this.
kw: Ny vynnav vy dybri hemma.

source: I don't want to eat anything.
kw: Ny vynnav vy dybri tra vydh.

source: Do you have to work tonight?
kw: Yw res dhis oberi haneth?

source: I don't want to talk.
kw: Ny vynnav vy kewsel.

source: I'm hungry.
kw: Yma nown dhymm.

source: I'm leaving today.
kw: Yth esov vy ow tiberth hedhyw.

source: What're you doing?
kw: Pyth esos ta ow kul?

source: Let's do that again.
kw: Gwren gul henna arta.

source: Wait here.
kw: Gorta omma.

source: I am not your enemy.
kw: Nyns ov dha eskar.

source: Tom is over there.
kw: Yma Tom yn-hons.

source: Tom doesn't seem to know French.
kw: Yth hevel na wor Tomm kewsel Frynkek.

source: Where's the butter?
kw: Ple'ma'n amanyn?

source: We don't have to go.
kw: Nyns yw res dhyn mos.

source: That is all.
kw: Henn yw oll.

source: I don't want to go.
kw: Ny vynnav vy mos.

source: I can't see.
kw: Ny allav vy gweles.

source: I'm buying.
kw: Yth esov vy ow prena.

source: Good day.
kw: Dydh da.

source: You prefer coffee.
kw: Gwell yw genes koffi.

source: Where is the cat?
kw: Ple'ma an gath?

source: I can't leave now.
kw: Ny allav vy diberth lemmyn.

source: It was very small.
kw: Pur vyghan o.

source: Hello.
kw: Dydh da.

source: Don't talk to me like that.
kw: Na gows orthiv y’n vaner-na!

source: Come outside.
kw: Deus yn-mes.

source: No smoking!
kw: Megi difennys!

source: The weather is good today.
kw: Da yw an gewer hedhyw.

source: Tom is still crying.
kw: Yma Tom owth ola hwath.

source: Tom is dead.
kw: Tom yw marow.

source: Tom didn't see it.
kw: Ny’n gwelas Tomm.

source: Tom couldn't find Mary.
kw: Ny ylli Tomm kavos Maria.

source: Is that your mother?
kw: Yw henna agas mamm?

source: I'm happy.
kw: Lowen ov.

source: She is running.
kw: Yma hi ow ponya.

source: She speaks three languages.
kw: Hi a gews teyr yeth.

source: He speaks four languages.
kw: Ev a gews peder yeth.

source: Thank you.
kw: Meur ras dhis.

source: Do they have money?
kw: Eus arghans dhedha?

source: Does she have money?
kw: Eus mona dhedhi?

source: Does he have money?
kw: Eus mona dhodho?

source: Do we have to go?
kw: Yw res dhyn mos?

source: That's my wife.
kw: Ow gwreg yw honna.

source: Happy Christmas!
kw: Nadelik lowen!

source: I can't sing.
kw: Ny allav vy kana.

source: Have you seen Tom?
kw: A welsys ta Tom?

source: Do you like Tom?
kw: Yw da genes Tom?

source: Do you have to go now?
kw: Yw res dhis mos lemmyn?

source: Did you see Tom?
kw: A welsys ta Tom?

source: Can I get a dog?
kw: A allav vy kavos ki?

source: Who was that?
kw: Piw o henna?

source: Where's your dog?
kw: Ple'ma dha gi?

source: Where's your bag?
kw: Ple’ma dha sagh?

source: Where's my car?
kw: Ple’ma ow harr-tan?

source: Where are they?
kw: Ple’mons i?

source: What's his name?
kw: Pyth yw y hanow?

source: Is that for me?
kw: Yw henna ragov?

source: Is that a good idea?
kw: Yw henna tybyans da?

source: Is that a crime?
kw: Yw henna drogober?

source: I can hear the wind.
kw: My a yll klewes an gwyns.

source: I could kiss you.
kw: My a allsa amma dhis.

source: I didn't have to go.
kw: Nyns o res dhymm mos.

source: I don't have to be here.
kw: Nyns yw res dhymm bos omma.

source: I had to do something.
kw: Res o dhymm gul neppyth.

source: I have to do this.
kw: Res yw dhymm gul hemma.

source: I have to go.
kw: Res yw dhymm mos.

source: I like your dog.
kw: Da yw genev dha gi.

source: I prefer to walk.
kw: Gwell yw genev kerdhes.

source: I want to stay.
kw: My a vynn gortos.

source: I was sleeping.
kw: Yth esen vy ow koska.

source: We had to stop.
kw: Res o dhyn hedhi.

source: I had to stop.
kw: Res o dhymm hedhi.

source: I'm listening.
kw: Yth esov vy ow koslowes.

source: I'm not surprised.
kw: Nyns eus marth dhymm.

source: I'm not tired.
kw: Nyns ov skwith.

source: I've been working.
kw: My re bia owth oberi.

source: We're working.
kw: Yth eson ni owth oberi.

source: We're listening.
kw: Yth eson ni ow koslowes.

source: We understand.
kw: Ni a gonvedh.

source: We need to leave.
kw: Res yw dhyn diberth.

source: We need to hurry.
kw: Res yw dhyn fistena.

source: We need to go.
kw: Res yw dhyn mos.

source: We must do it again.
kw: Res yw dhyn y wul arta.

source: We have to talk.
kw: Res yw dhyn kewsel.

source: We have to leave now.
kw: Res yw dhyn diberth lemmyn.

source: We have to hurry.
kw: Res yw dhyn fistena.

source: We have to go now.
kw: Res yw dhyn mos lemmyn.

source: We don't have to do that.
kw: Nyns yw res dhyn gul henna.

source: We could go together.
kw: Ni a allas mos war-barth.

source: Where are the others?
kw: Ple’ma’n re erel?

source: It's too late.
kw: Re dhiwedhes yw.

source: It's beautiful.
kw: Teg yw.

source: You have to hurry.
kw: Res yw dhis fistena.

source: You have to go home.
kw: Res yw dhis mos tre.

source: You can't do this.
kw: Ny yll'ta gul hemma.

source: That was very good.
kw: Henn o pur dha.

source: This is my wife.
kw: Homm yw ow gwreg.

source: They're coming.
kw: Yth esons i ow tos.

source: These are beautiful.
kw: An re ma yw teg.

source: You must find work.
kw: Res yw dhis kavos ober.

source: He must find work.
kw: Res yw dhodho kavos ober.

source: She must find work.
kw: Res yw dhedhi kavos ober.

source: You don't need to wait.
kw: Nyns yw res dhis gortos.

source: Are you looking?
kw: Esos ta ow mires?

source: Coffee, please.
kw: Koffi, mar pleg.

source: I can't eat this.
kw: Ny allav vy dybri hemma.

source: I can't eat pork.
kw: Ny allav vy dybri kig mogh.

source: I can't wait.
kw: Ny allav vy gortos.

source: We left together.
kw: Ni a dhibarthas war-barth.

source: My cat is following me.
kw: Yma ow hath orth ow holya.

source: We must do it now.
kw: Res yw dhyn y wul lemmyn.

source: I must do it now.
kw: Res yw dhymm y wul lemmyn.

source: He must do it now.
kw: Res yw dhodho y wul lemmyn.

source: She must do it now.
kw: Res yw dhedhi y wul lemmyn.

source: Do you see a queen?
kw: A welydh myghternes?

source: How beautiful!
kw: Ass yw teg!

source: The dog wants to leave.
kw: An ki a vynn diberth.

source: She wants to learn to swim.
kw: Hi a vynn dyski neuvya.

source: I hate sand.
kw: Kas yw genev tewes.

source: She wants to talk to you.
kw: Hi a vynn kewsel orthis.

source: I've been trying to find my keys.
kw: My re bia owth assaya kavos ow alhwedh.

source: My friend helped me.
kw: Ow hothman a’m gweresas.

source: I'd like to lie down.
kw: My a vynnsa gorwedha.

source: I'm not your son.
kw: Nyns ov dha vab.

source: This isn't silver.
kw: Nyns yw hemma arghans.

source: The cat is hiding under the couch.
kw: Yma’n gath owth omgudha yn-dann an gweli-dydh.

source: You can't come tomorrow.
kw: Ny yll'ta dos a-vorow.

source: I can't come tonight.
kw: Ny allav vy dos haneth.

source: I can't dance.
kw: Ny allav vy donsya.

source: I can't drive.
kw: Ny allav vy lewya.

source: I can't eat chicken.
kw: Ny allav vy dybri kig yar.

source: I can't eat peanuts.
kw: Ny allav vy dybri know dor.

source: I can't eat.
kw: Ny allav dybri.

source: I can't go home.
kw: Ny allav vy mos tre.

source: You can't go yet.
kw: Ny yll'ta mos hwath.

source: I can't go.
kw: Ny allav vy mos.

source: Tom can't help you now.
kw: Ny yll Tom dha weres lemmyn.

source: I can't help.
kw: Ny allav vy gweres.

source: You can't leave now.
kw: Ny yll'ta diberth lemmyn.

source: You can't leave yet.
kw: Ny yll'ta diberth hwath.

source: I can't read this.
kw: Ny allav vy redya hemma.

source: I can't read.
kw: Ny allav vy redya.

source: I can't remember anything.
kw: Ny allav vy perthi kov tra vyth.

source: I can't say that.
kw: Ny allav vy leverel henna.

source: You can't say that.
kw: Ny yll'ta leverel henna.

source: I can't see it.
kw: Ny allav y weles.

source: I can't stay.
kw: Ny allav vy gortos.

source: I can't talk now.
kw: Ny allav vy kewsel lemmyn.

source: I can't tell you.
kw: Ny allav vy leverel dhis.

source: I can't understand.
kw: Ny allav vy konvedhes.

source: I can't walk.
kw: Ny allav vy kerdhes.

source: I can't watch.
kw: Ny allav vy mires orth.

source: Don't read in that room.
kw: Na red y’n stevel-na.

source: Here's your dog.
kw: Ottomma dha gi.

source: I thought you were sleeping.
kw: My a brederis dha vos ow koska.

source: I have a terrible headache.
kw: Yma drog penn euthyk dhymm.

source: I have a girlfriend.
kw: Yma kares dhymm.

source: Listen to her!
kw: Goslow orti!

source: You have to come.
kw: Res yw dhis dos.

source: He has to come.
kw: Res yw dhodho dos.

source: I want to go.
kw: My a vynn mos.

source: I want to come.
kw: My a vynn dos.

source: He wants to go.
kw: Ev a vynn mos.

source: He wants to come.
kw: Ev a vynn dos.

source: She wants to go.
kw: Hi a vynn mos.

source: She wants to come.
kw: Hi a vynn dos.

source: He's looking at you.
kw: Yma ev ow mires orthowgh.

source: She's looking at you.
kw: Yma hi ow mires orthis.

source: I have to buy flowers for my girlfriend.
kw: Res yw dhymm prena bleujyow rag ow hares.

source: A cat is on the table.
kw: Yma kath war'n voos.

source: That is our father.
kw: Henn yw agan tas.

source: He has smooth hands.
kw: Yma dhodho diwla smodh.

source: I've got a book.
kw: Yma genev lyver.

source: There's a book with me.
kw: Yma genev lyver.

source: What is the weather like?
kw: Fatel yw an gewer?

source: The weather is fine today.
kw: An gewer yw brav hedhyw.

source: I own a computer.
kw: My a bew jynn-amontya.

source: Do you like chocolate milk?
kw: Yw da genes leth choklet?

source: Do you like sweet tea?
kw: Yw da genes te hweg?

source: I can't find the newspaper.
kw: Ny allav kavos an paper-nowodhow.

source: She wanted to meet me.
kw: Hi a vynna metya orthiv.

source: The exam is easy.
kw: An apposyans yw es.

source: The exam is difficult.
kw: An apposyans yw kales.

source: Tom died.
kw: Tom a verwis.

source: He needs to speak English.
kw: Res yw dhodho kewsel Sowsnek.
